{
    "projects": [
        {
            "projectId": 1,
            "title": "Remote Patient Monitoring",
            "onGithub": false,
            "link": "",
            "image": "rpm.jpg",
            "desc": "Patient Montoring with the help of IoT and Cloud to efficiently keep track of patient conditions. Used sensors and microcontroller to gather vitals' information of patient and store it in the cloud. Use this information to perform analytics and predict lung disease from ECG. User can access this information through web portal via login. Efficint tracking of patient condition during COVID times."
        },
        {
            "projectId": 2,
            "title": "Benchmarking and Fairness Estimation on Biomedical Imagery",
            "onGithub": false,
            "link": "",
            "image": "chest.jpg",
            "desc": "Comparative study between state-of-the-art Vision transformer algorithms and self supervised algorithm. Used ViT, Swin V1, ConvNeXt along with REMEDIS self-supervised algorithm for chest X-ray classification. Performed OOD detection using dataset from China(shenzhen) and gender bias analysis between all the mentioned algorithms."
        },
        {
            "projectId": 3,
            "title": "Language and Robotics",
            "onGithub": false,
            "link": "",
            "image": "robot.jpg",
            "desc": "Predict next action for a robot given previous actions and image features as well as summarize robot actions. Use natural language along with image features using CLIP transformer model to generate next instructions. Used GPT2 model to generate summarization of robot actions."
        },
        {
            "projectId": 4,
            "title": "Resume Analyzer",
            "onGithub": false,
            "link": "",
            "image": "gemini.jpg",
            "desc": "Employed LLM agents for tailoring resume using LangGraph and Gemini 2.0. Used feedback loop to improve the resume relevancy score based on job description. Containerized the application using Docker and deployed with the help of Kubernetes. Ensured scalable and robust deployment setup."
        },
        {
            "projectId": 5,
            "title": "Walmart Sales Forcasting",
            "onGithub": false,
            "link": "",
            "image": "sales.jpg",
            "desc": "Analyzed sales and product data across 3 regions across multiple categories. Used ARIMA, LSTM, SARIMAX and Prophet models to forecast sales for next 6 months. Performed feature engineering and data preprocessing to build robust models and increase accuracy by 12% from baseline."
        },
        {
            "projectId": 6,
            "title": "PolicyRAG",
            "onGithub": false,
            "link": "",
            "image": "rag.png",
            "desc": "Designed a Retreval Augmented Generation model for policy documents. Utilized web scraper using Selenium to gather policy documents from college website and performed proprocessing by converting PDF to text and chunking the text. Paased these chunks to LLM embedding model producing text embeddings for similarity search qith the user query. Produced context aware responses to user queries and reduced customer support workload by estimated 30%."
        },
        {
            "projectId": 7,
            "title": "American Sign Language Detection",
            "onGithub": false,
            "link": "",
            "image": "asl.png",
            "desc": "Sign language is the primary mode of communication for deaf people and and people with hearing disabilities. Common people are not aware of the sign language and its interpretation to spoken language like English. To tackle this shortcoming, we developed ASL Detection for letters as well as words using images and videos using YOLOv5 and I3D respectively."
        },
        {
            "projectId": 8,
            "title": "YelpCamp",
            "onGithub": true,
            "link": "https://github.com/Mik-27/Yelp_Camp",
            "image": "yelpcamp.jpg",
            "desc": "Web application developed with Node JS, Bootstrap and HTML/CSS for browsing campgrounds and leave comments. Developed user login functionality and authentication for urls. Used MongoDB as storage to store users, user comments and campgrounds."
        },
        {
            "projectId": 9,
            "title": "Plant Disease Prediction",
            "onGithub": false,
            "link": "",
            "image": "PDP.jpg",
            "desc": "Predicting plant diseases and anamolies based on images of leaves. Generating prediction for the type of diseases using Convolutional Neural Network. Performed data augmentations to build robust model and facilitate accurate predictions."
        },
        {
            "projectId": 10,
            "title": "Traffic Management System",
            "onGithub": true,
            "link": "https://github.com/Mik-27/VH-21-31-Supernovas",
            "image": "traffic.jpg",
            "desc": "System to manage Traffic efficiently using Machine Learning and signaling algorithm. Used YOLOv3 model to detect vehicles crossing a node. Count number of vehicles to estimate traffic at each node and use this information for changing the signals and their duration. Developed algorithm to change signals based on traffic at each intersection. Developed as part of  a 2-day Hackathon."
        },
        {
            "projectId": 11,
            "title": "BeastWatch",
            "onGithub": false,
            "link": "",
            "image": "animal.jpg",
            "desc": "Designed plan for developing a CCTV camera based application for monitoring and tracking animals in forest. Used YOLOv9 model to detect animals and track them with an aim to reduce wild attacks and general tracking of wild animals. Used OpenCV for tracking and monitoring animals. Developed as part of a 5-hour ideation hackathon."
        }
    ]
}
